package com.example.jpa.Type;

public class ValueType {
    /*
    JPA 의 데이터 타입 분류
    - 엔티티 타입
        • @Entity 로 정의하는 객체
        • 데이터가 변해도 식별자로 지속해서 추적 가능
        • 예) 회원 엔티티의 키나 나이 값을 변경해도 식별자로 인식 가능
    - 값 타입
        • int, Integer, String 처럼 단순히 값으로 사용하는 자바 기본 타입이나 객체
        • 식별자가 없고 값만 있으므로 변경시 추적 불가
        • 예) 숫자 100을 200으로 변경하면 완전히 다른 값으로 대체

    값 타입 분류
    1. 기본값 타입
        • 예): String name, int age
        • 생명주기를 엔티티의 의존
            • 예) 회원을 삭제하면 이름, 나이 필드도 함께 삭제
        • 값 타입은 공유하면 X
            • 예) 회원 이름 변경시 다른 회원의 이름도 함께 변경되면 안됨

    2. 임베디드 타입(embedded type, 복합 값 타입)
        - 새로운 값 타입을 직접 정의할 수 있음
        - 주로 기본 값 타입을 모아서 만들어서 복합 값 타입이라고도 함
        - 임베디드 타입 사용법
            • @Embeddable: 값 타입을 정의하는 곳에 표시
            • @Embedded: 값 타입을 사용하는 곳에 표시
            • 기본 생성자 필수
        - 임베디드 타입의 장점
            • 재사용
            • 높은 응집도
            • Period.isWork() 처럼 해당 값 타입만 사용하는 의미 있는 메소드를 만들 수 있음
            • 임베디드 타입을 포함한 모든 값 타입은, 값 타입을 소유한 엔티티에 생명주기를 의존함
        - 임베디드 타입과 테이블 매핑
            • 임베디드 타입은 엔티티의 값일 뿐이다.
            • 임베디드 타입을 사용하기 전과 후에 매핑하는 테이블은 같다.
            • 객체와 테이블을 아주 세밀하게(find-grained) 매핑하는 것이 가능
            • 잘 설계한 ORM 애플리케이션은 매핑한 테이블의 수보다 클래스의 수가 더 많음
            • 임베디드 타입의 값이 null 이면 매핑한 컬럼 값은 모두 null
        - @AttributeOverride: 속성 재정의
            • 한 엔티티에서 같은 값 타입을 사용하면? 컬럼 명이 중복됨
            • @AttributeOverrides, @AttributeOverride 를 사용해서 컬럼명 속성을 재정의

    3. 컬렉션 값 타입(collection value type
        - 값 타입을 하나 이상 저장할 때 사용
        - @ElementCollection, @CollectionTable 사용
        - 데이터베이스는 컬렉션을 같은 테이블에 저장할 수 없다.
        - 컬렉션을 저장하기 위한 별도의 테이블이 필요함
        - 값 타입 컬렉션은 영속성 전이(Cascade) + 고아 객체 제거 기능을 필수로 가진다고 볼 수 있다.
        - 값 타입 컬렉션의 제약사항
            • 값 타입은 엔티티와 다르게 식별자 개념이 없다.
            • 값은 변경하면 추적이 어렵다.
            • 값 타입 컬렉션에 변경 사항이 발생하면, 주인 엔티티와 연관된 모든 데이터를 삭제하고, 값 타입 컬렉션에 있는 현재 값을 모두 다시 저장한다.
            • 값 타입 컬렉션을 매핑하는 테이블은 모든 컬럼을 묶어서 기본키를 구성해야 함: null 입력X, 중복 저장X
    */
}
